#include "pch.h"
#include "CPiece.h"

/*생성자*/
CPiece::CPiece() {
    x = 275; y = 480; //초기 시작점
    count = 0;
    catched = 0;
}

void CPiece:: Move(int n)    
{
    /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    /*테스트라인
    if (x == 275 && y == 480) {
        switch (n) {
        case 1: x = 0; y = 0; case 2: x = 0; y = 0; case 3: x = 0; y = 0; case 4: x = 0; y = 0; case 5: x = 0; y = 0; }
    }


    */
    //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    if (count == 0 || catched == 1) { //최초원점
        x = x + (42 * n);
        y = y - (41 * n);
        if (x > 485) {
            x = 970 - x;
        }
        catched = 0;
    }
    else if (x > 275 && x < 485 && y>275 && y < 480) { // ↗방향
        x = x + (42 * n);
        y = y - (41 * n);
        if (x > 485) {
            x = 970 - x;
        }
    }

    else if (x > 275 && x < 485 && y < 275 && y > 70) {   // ↖방향
        x = x - (42 * n);
        y = y - (41 * n);
        if (y < 70) {
            y = 140 - y;
        }
    }

    else if (x < 275 && x>65 && y < 275 && y > 70) {      // ↙방향
        x = x - (42 * n);
        y = y + (41 * n);
        if (x < 65) {
            x = 130 - x;
        }
    }
    else if (x < 275 && x >= 65 && y >= 275 && y <480) {     // ↘방향
        if (y == 275) {
            if (x == 65) {
                x = x + (42 * n);
                y = y + (41 * n);
                if (x > 275) {  //홈을 넘어야 완주
                    x = -1;
                    y = -1;
                }
            }
            else {
                x = x - (70 * n);
                y = 275;
                if (x < 65 && y == 275) {                      //중간에 멈추지 않고 쭉 간 경우
                    x = 65 + 42 * (65 - (x - (70 * n))) / 70;
                    y = 275 + 41 * (65 - (x - (70 * n))) / 70;
                }
                if (x == 245) {                                // 중간지점에 도착한경우
                    x = 275;
                    y = 280;
                }
            }
        }
        else {
            x = x + (42 * n);
            y = y + (41 * n);
            if (x > 275) {  //홈을 넘어야 완주
                x = -1;
                y = -1;
            }
        }
    }

    else if (x <= 485 && x > 65 && y == 275) {     // -방향
        if (x == 275 && y == 275 && y == 280) {
            x = 275;
            y = y + (70 * n);
            if (y > 490) {    // 490을 넘어야 완주
                x = -1;
                y = -1;
            }
        }
        else {
            x = x - (70 * n);
            y = 275;
            if (x < 65 && y == 275) {                      //중간에 멈추지 않고 쭉 간 경우
                x = 65 + 42 * (65 - (x - (70 * n))) / 70;
                y = 275 + 41 * (65 - (x - (70 * n))) / 70;
            }
            if (x == 245) {                                // 중간지점에 도착한경우
                x = 275;
                y = 280;
            }
        }
    }

    else if (x == 275 && y >= 70) {                 // |방향
        x = 275;
        y = y + (70 * n);
        if (y > 490) {    // 490을 넘어야 완주
            x = -1;  
            y = -1;
        }
    }
    if (count != 0 && catched == 0) { //한바퀴 돌아 원점에 도착한 후 던졌을떄
        if (x == 275 && y == 480) {
            x = -1;
            y = -1;
        }
    }
    count++;
}